/* =========================================================
   像素文件夹小部件 · 文字与样式配置（由工作台导出）
   将此文件放到 基础部件.html 同目录即可，无需改动基础部件
   ========================================================= */
window.WIDGET_TEXT = {
  "folder": {
    "name": "LIVE 2D",
    "nameSize": 60,
    "hue": 254,
    "saturation": 86,
    "brightness": 115
  },
  "pages": [
    {
      "title": {
        "text": "全身LIVE 2D模型绘制",
        "x": 52,
        "y": 144,
        "w": 310,
        "h": 36,
        "size": 20
      },
      "body": {
        "text": "530 USD\n【交付包含】\nPSD文件\n简单分层\n部件分层\n简单道具/吉祥物\n3个贴图表情\n",
        "x": 48,
        "y": 199,
        "w": 303,
        "h": 229,
        "size": 14
      },
      "images": []
    },
    {
      "title": {
        "text": "全身LIVE 2D模型额外购买",
        "x": 107,
        "y": 138,
        "w": 200,
        "h": 62,
        "size": 20
      },
      "body": {
        "text": "一套服装  150 USD/套\n贴图表情  8 USD/个\n动画表情 \n按实际需要绘制复杂度计算价格\n武器道具\n若为复杂部件则按复杂度计算价格\n",
        "x": 48,
        "y": 203,
        "w": 303,
        "h": 237,
        "size": 15
      },
      "images": []
    },
    {
      "title": {
        "text": "LIVE 2D Q版模型绘制",
        "x": 86,
        "y": 152,
        "w": 239,
        "h": 53,
        "size": 20
      },
      "body": {
        "text": " 70 USD\n【交付包含】\nPSD文件\n简单分层\n部件分层\n2个贴图表情\n迷你小道具",
        "x": 49,
        "y": 193,
        "w": 303,
        "h": 237,
        "size": 15
      },
      "images": []
    },
    {
      "title": {
        "text": "LIVE 2D 高精度模型拆分",
        "x": 80,
        "y": 151,
        "w": 264,
        "h": 63,
        "size": 20
      },
      "body": {
        "text": "60 USD\n(外语进行图层备注困难，暂不接中文以外的委托)",
        "x": 61,
        "y": 199,
        "w": 292,
        "h": 242,
        "size": 21
      },
      "images": []
    }
  ]
};
