/* =========================================================
   像素文件夹小部件 · 文字与样式配置（由工作台导出）
   将此文件放到 基础部件.html 同目录即可，无需改动基础部件
   ========================================================= */
window.WIDGET_TEXT = {
  "folder": {
    "name": "YCH模板",
    "nameSize": 60,
    "hue": 45,
    "saturation": 119,
    "brightness": 129
  },
  "pages": [
    {
      "title": {
        "text": "按A和像素小人对话",
        "x": 64,
        "y": 136,
        "w": 295,
        "h": 46,
        "size": 23
      },
      "body": {
        "text": "15 USD\n把你的角色变成复古RPG里的像素角色，24小时内交付！\n━━━━━━━━━━━━━━\n💰 Price｜价格：$10💳 Full payment upfront｜确认委托后一次性付清\n【包含内容】像素胸像\n闭嘴待机版（无对话）  \n对话版（含自定义台词）",
        "x": 51,
        "y": 187,
        "w": 182,
        "h": 253,
        "size": 12
      },
      "images": [
        {
          "src": "图片/1.png",
          "x": 237,
          "y": 175,
          "w": 181,
          "h": 276
        }
      ]
    },
    {
      "title": {
        "text": "拼装模型Q版挂件",
        "x": 64,
        "y": 136,
        "w": 295,
        "h": 46,
        "size": 23
      },
      "body": {
        "text": "20 USD\n包含内容Q版人物 \n专属小物件 ×3\n2 个替换表情\n摇摆挂件动图\n板件颜色跟随角色配色，板件上可加名字或 ID",
        "x": 51,
        "y": 187,
        "w": 182,
        "h": 253,
        "size": 17
      },
      "images": [
        {
          "src": "图片/2.gif",
          "x": 107,
          "y": 171,
          "w": 337,
          "h": 227
        }
      ]
    },
    {
      "title": {
        "text": "可定制Q版LIVE 2D模板模型",
        "x": 42,
        "y": 139,
        "w": 335,
        "h": 55,
        "size": 23
      },
      "body": {
        "text": "绘制：葉荼/模型：鱼紫\n—————————————————\nNT$4800+\n【价格随人设复杂度增加】\n【一般复杂+20-30%\n非常复杂+30-40%】",
        "x": 51,
        "y": 187,
        "w": 318,
        "h": 243,
        "size": 17
      },
      "images": []
    },
    {
      "title": {
        "text": "",
        "x": 42,
        "y": 139,
        "w": 335,
        "h": 55,
        "size": 23
      },
      "body": {
        "text": "〔插画〕\n✧ 角色设计：新台币 NT$2000（含三视图）\n✧ 额外静态表情：每项NT$175.5 \n✧ 特殊动画：每项 NT$351+\n〔绑定〕\n✧ 猫耳朵 +NT$117（包含表情追踪）\n✧ 其他动物耳朵 +NT$351\n✧ 现有配件切换 +NT$117\n✧表情/差分開關 NT$300\n✧表情/差分動畫 NT$200up\n✧ 睡眠动画（无追踪） +NT$351\n✦——————✦——————✦\n",
        "x": 42,
        "y": 111,
        "w": 315,
        "h": 310,
        "size": 17
      },
      "images": []
    },
    {
      "title": {
        "text": "",
        "x": 42,
        "y": 139,
        "w": 335,
        "h": 55,
        "size": 23
      },
      "body": {
        "text": "",
        "x": 42,
        "y": 111,
        "w": 315,
        "h": 310,
        "size": 17
      },
      "images": [
        {
          "src": "图片/bT0HYz-jFpD.png",
          "x": 69,
          "y": 121,
          "w": 274,
          "h": 156
        },
        {
          "src": "图片/bT0HYz-oS0d.png",
          "x": 66,
          "y": 278,
          "w": 279,
          "h": 159
        }
      ]
    }
  ]
};
